In [71]:
import pandas as pd

In [72]:
data = {
    "Nombre":["Adrian","Josue","Carlos","Mango"],
    "Fruta":["Piña","Coco","Mora","Mango"]
}

data

{'Nombre': ['Adrian', 'Josue', 'Carlos', 'Mango'],
 'Fruta': ['Piña', 'Coco', 'Mora', 'Mango']}

In [73]:
compras = pd.DataFrame(data, index=["1","2","3","4"])

compras

   Nombre  Fruta
1  Adrian   Piña
2   Josue   Coco
3  Carlos   Mora
4   Mango  Mango

In [74]:
data2 = {
    "Nombres" : ["Josue","Carlos","Richard","Gabo","Anthony"],
    "Cedula":["12345","21345","31245","41235","51234"],
    "Telefono":["0987654321","0987654322","0987654323","0987654324","0987654325"],
    "Signo":["Escorpio","Leo","Virgo","Cancer","Aries"],
    "Direccion":["Quitumbe","Bicentenario","CardelYork","Shiris","Joinville"]
}

data2

{'Nombres': ['Josue', 'Carlos', 'Richard', 'Gabo', 'Anthony'],
 'Cedula': ['12345', '21345', '31245', '41235', '51234'],
 'Telefono': ['0987654321',
  '0987654322',
  '0987654323',
  '0987654324',
  '0987654325'],
 'Signo': ['Escorpio', 'Leo', 'Virgo', 'Cancer', 'Aries'],
 'Direccion': ['Quitumbe',
  'Bicentenario',
  'CardelYork',
  'Shiris',
  'Joinville']}

In [75]:
agenda = pd.DataFrame(data2, index=["1","2","3","4","5"])

agenda

   Nombres Cedula    Telefono     Signo     Direccion
1    Josue  12345  0987654321  Escorpio      Quitumbe
2   Carlos  21345  0987654322       Leo  Bicentenario
3  Richard  31245  0987654323     Virgo    CardelYork
4     Gabo  41235  0987654324    Cancer        Shiris
5  Anthony  51234  0987654325     Aries     Joinville

In [76]:
compras.to_csv("compras.csv")

In [77]:
agenda.to_csv("agenda.csv")

In [78]:
compras.to_json("compras.json")

In [79]:
agenda.to_json("agenda.json")

In [80]:
df = pd.read_json("agenda.json")
df2 = df.set_index("Cedula")
df2

        Nombres   Telefono     Signo     Direccion
Cedula
12345     Josue  987654321  Escorpio      Quitumbe
21345    Carlos  987654322       Leo  Bicentenario
31245   Richard  987654323     Virgo    CardelYork
41235      Gabo  987654324    Cancer        Shiris
51234   Anthony  987654325     Aries     Joinville

In [81]:
compras= pd.read_json("compras.json")

compras

   Nombre  Fruta
1  Adrian   Piña
2   Josue   Coco
3  Carlos   Mora
4   Mango  Mango

In [82]:
import sqlite3

In [83]:
conexion = sqlite3.connect("database.db")

In [84]:
df = pd.read_sql_query("select * from compras", conexion)

df

   id   nombre    fruta  cantidad
0   1   Adrian     Coco        16
1   2   Josuea     Mora        21
2   3   Carlos  Bananas        14
3   4  Richard    Peras        12
4   5   3likte  Guarana        10

In [85]:
df1 = df.set_index("id")
df1

     nombre    fruta  cantidad
id
1    Adrian     Coco        16
2    Josuea     Mora        21
3    Carlos  Bananas        14
4   Richard    Peras        12
5    3likte  Guarana        10

In [86]:
db1 = pd.read_sql_query("select fruta, max(cantidad) as total from compras group by fruta order by total", conexion)
db1

     fruta  total
0  Guarana     10
1    Peras     12
2  Bananas     14
3     Coco     16
4     Mora     21

In [87]:
compras.to_sql("new_compras", conexion)

ValueError: Table 'new_compras' already exists.

In [ ]:
compras

   Nombre  Fruta
1  Adrian   Piña
2   Josue   Coco
3  Carlos   Mora
4   Mango  Mango

In [ ]:
amigos = pd.DataFrame(data2)

In [ ]:
amigos.to_sql("amigos", conexion)

In [ ]:
amigos

   Nombres Cedula    Telefono     Signo     Direccion
0    Josue  12345  0987654321  Escorpio      Quitumbe
1   Carlos  21345  0987654322       Leo  Bicentenario
2  Richard  31245  0987654323     Virgo    CardelYork
3     Gabo  41235  0987654324    Cancer        Shiris
4  Anthony  51234  0987654325     Aries     Joinville

In [91]:
a1 = pd.read_json("agenda1.json")
a2 = pd.read_json("agenda2.json")
a3 = pd.read_json("agenda3.json")
a4 = pd.read_json("agenda4.json")
a5 = pd.read_json("agenda5.json")

In [92]:
df3 = pd.concat([a1,a2,a3,a4,a5])

In [94]:
agenda = pd.DataFrame(df3)

In [95]:
agenda.to_sql("agenda", conexion)

100

In [100]:
db2 = pd.read_sql_query("select * from agenda", conexion)
coso = db2.set_index("Cedula")
coso

         index   Nombres   Telefono        Signo              Direccion
Cedula
212345      21   Esteban  987654341      Acuario                 La Paz
222345      22    Isabel  987654342        Virgo             Miraflores
232345      23     Mario  987654343      Geminis           Av. Amazonas
242345      24  Cristina  987654344     Escorpio             El Condado
252345      25   Ricardo  987654345    Sagitario            La Carolina
...        ...       ...        ...          ...                    ...
962345      96   Natalia  987654416      Acuario                 La Luz
972345      97     Ramón  987654417  Capricornio            Villa Flora
982345      98   Valeria  987654418       Piscis      San José de Minas
992345      99    Felipe  987654419     Escorpio            Santa Clara
1002345    100   Silvana  987654420        Tauro  Calle de los Laureles

[100 rows x 5 columns]